{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "news_military",
    "1": "news_culture",
    "2": "news_entertainment",
    "3": "news_travel",
    "4": "news_world",
    "5": "news_car",
    "6": "news_game",
    "7": "news_sports",
    "8": "news_edu",
    "9": "news_finance",
    "10": "news_tech",
    "11": "news_story",
    "12": "news_house",
    "13": "news_agriculture",
    "14": "stock"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "news_agriculture": 13,
    "news_car": 5,
    "news_culture": 1,
    "news_edu": 8,
    "news_entertainment": 2,
    "news_finance": 9,
    "news_game": 6,
    "news_house": 12,
    "news_military": 0,
    "news_sports": 7,
    "news_story": 11,
    "news_tech": 10,
    "news_travel": 3,
    "news_world": 4,
    "stock": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.7.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 21128
}
